//{----------------------------------------------------------------------------
//! @file input.h
//{----------------------------------------------------------------------------

#include <stdio.h>

//-----------------------------------------------------------------------------

/// \brief Очистка буфера ввода до конкретного символа
/// \param [in] stop_sym

void clear_buffer  (char stop_sym);

/// \brief Функция для выхода из режима ввода
/// \param [in] exit_sym Стоп слово :)

bool check_on_exit (char exit_sym);

//-----------------------------------------------------------------------------
